ci/tasks/artillery-script.yml
config:
  target: 'http://someserver.com'
  phases:
    - duration: 150
      arrivalRate: 2
  defaults:
scenarios:
  - flow:
    - get:
        url: "/"
        headers: 
          x-Dynatrace: 'NA=Test.Homepage;'
    - get:
        url: "/albums"
        headers: 
          x-Dynatrace: 'NA=Test.Albums;'